In [3]:
import pandas as pd
import numpy as np

In [27]:
df = pd.read_csv(r'jeopardy.csv')
pd.set_option('display.max_colwidth',7)

In [5]:
df.head()

   Show Number  Air Date   Round  Category  Value  Question  Answer
0    4680       200...    Jeo...  HIS...     $200  For...    Cop...
1    4680       200...    Jeo...  ESP...     $200  No....    Jim...
2    4680       200...    Jeo...  EVE...     $200  The...    Ari...
3    4680       200...    Jeo...  THE...     $200  In ...    McD...
4    4680       200...    Jeo...  EPI...     $200  Sig...    Joh...

In [6]:
df.columns

Index(['Show Number', ' Air Date', ' Round', ' Category', ' Value',
       ' Question', ' Answer'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 216930 entries, 0 to 216929
Data columns (total 7 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Show Number  216930 non-null  int64
 1    Air Date    216930 non-null  object
 2    Round       216930 non-null  object
 3    Category    216930 non-null  object
 4    Value       216930 non-null  object
 5    Question    216930 non-null  object
 6    Answer      216928 non-null  object
dtypes: int64(1), object(6)
memory usage: 6.6+ MB

In [8]:
df.isnull().sum()

Show Number    0
 Air Date      0
 Round         0
 Category      0
 Value         0
 Question      0
 Answer        2
dtype: int64

In [9]:
df.shape

(216930, 7)

In [10]:
df['Show Number'].unique()

array([4680, 5957, 3751, ..., 5070, 5195, 4999], dtype=int64)

In [11]:
df[' Air Date'].unique()

array(['2004-12-31', '2010-07-06', '2000-12-18', ..., '2006-09-29',
       '2007-03-23', '2006-05-11'], dtype=object)

In [12]:
df[' Round'].unique()

array(['Jeopardy!', 'Double Jeopardy!', 'Final Jeopardy!', 'Tiebreaker'],
      dtype=object)

In [13]:
df[' Category'].unique()

array(['HISTORY', "ESPN's TOP 10 ALL-TIME ATHLETES",
       'EVERYBODY TALKS ABOUT IT...', ..., 'OFF-BROADWAY',
       'RIDDLE ME THIS', 'AUTHORS IN THEIR YOUTH'], dtype=object)

In [14]:
df[' Value']

0          $200
1          $200
2          $200
3          $200
4          $200
          ...
216925    $2000
216926    $2000
216927    $2000
216928    $2000
216929     None
Name:  Value, Length: 216930, dtype: object

In [15]:
df[' Question'].unique()

array(["For the last 8 years of his life, Galileo was under house arrest for espousing this man's theory",
       'No. 2: 1912 Olympian; football star at Carlisle Indian School; 6 MLB seasons with the Reds, Giants & Braves',
       'The city of Yuma in this state has a record average of 4,055 hours of sunshine each year',
       ...,
       'In Penny Lane, where this "Hellraiser" grew up, the barber shaves another customer--then flays him alive!',
       'From Ft. Sill, Okla. he made the plea, Arizona is my land, my home, my father\'s land, to which I now ask to... return"',
       'A silent movie title includes the last name of this 18th c. statesman & favorite of Catherine the Great'],
      dtype=object)

In [16]:
df[' Answer']

0         Cop...
1         Jim...
2         Ari...
3         McD...
4         Joh...
           ...
216925    Tur...
216926    a t...
216927    Cli...
216928    Ger...
216929    Gri...
Name:  Answer, Length: 216930, dtype: object

## filtering out data where 'king' and 'England' is present in the Question column

In [17]:
# df2= df[(df[" Question"].str.contains("King|king"))&
# (df[" Question"].str.contains("England"))]

In [26]:
# df2.shape

In [56]:
#Filters dataset to only include rows with questions that contain all words in the user inputed list

In [57]:
def filter_question (dataset, words):
    filt = lambda x : all( word.lower() in x.lower() for word in words)
    return df.loc[df[' Question'].apply(filt)]

In [60]:
filterd = filter_question(df,['King', 'England'])

### create a new column 'values float' and replace the dollar first and change its data type

In [35]:
df['value float'] = df[' Value'].apply(lambda x : float(x[1:].replace(',', '') if x!= 'None' else 0))

In [59]:
df['value float']

0          200.0
1          200.0
2          200.0
3          200.0
4          200.0
           ...
216925    2000.0
216926    2000.0
216927    2000.0
216928    2000.0
216929       0.0
Name: value float, Length: 216930, dtype: float64

In [ ]:
#Returns a sum of each answer to a question that has the keywords

In [52]:
def unique_word(dataset, words):
    filtering = filter_question(dataset, words)
    unique_column = filtering.groupby(' Answer')[' Value'].count().reset_index()
    return unique_column.sort_values(by=[' Value'] ,ascending = False)

In [53]:
 df2 = unique_word(df, ['King'])

In [55]:
df2.shape

(5268, 2)